#include <bits/stdc++.h>     
using namespace std;
int main(){
    //1. Selection structure (โครงสร้างควบคุมการเลือกทาง) A.K.A ->"If - else statement"
   
    //2.Comparison operators (ตัวดำเนินการเปรียบเทียบ) -> >,>=,<,<=,==,!= คืนค่าเป็น boolean(true,false)
    
    //3.Logical operators (ตัวดำเนินการทางตรรกศาสตร์) -> &&,||,!
    /*
        short circuit
        a1 || a2 || a3 || ... || an พิจารณาจากซ้ายไปขวา หยุดก็ต่อเมื่อหมด หรือ เจอ true
        a1 && a2 && a3 && ... && an พิจารณาจากซ้ายไปขวา หยุดก็ต่อเมื่อหมด หรือ เจอ false
        ex . if( 1>2 || 3>2 && 5>1)
        And &&
        Or ||
        not !
    */
   
    //4.Ternary operators simple form of if-else statement
    /* 
    type Var_name = (condition)? true:false 
    ex. int a = (1>2)? 10 : -10 ; output is -10
    */
   

    //5.Operator precedence (ลำดับความสำคัญของตัวดำเนินการ)
    /*
        1. a++,a--,function call()
        2. ++a,--a,!(expr)
        3. *,/,%
        4. +,-
        5. <<,>> input / output / bitwise shift
        6. <,<=,>=,>
        7. ==,!=
        8.&&
        9.||
        10. assignment (+=,-=,etc...)
    */
    //6.Variable scope (ขอบเขตตัวแปร)
    /*
        Global variable -> เป็นตัวแปรที่อยู่นอกฟังก์ชั่น ทุกฟังก์ชั่นเรียกได้หมด
        Local variable  -> เป็นตัวแปรที่อยู่ในแต่ละฟังก์ชั่น/block สามารถเรียกใช้ได้แค่ในฟังก์ชั่นนั้นๆ
    */
    //7.Type casting(การเปลี่ยนประเภทตัวแปร)
    /*
        type VarName = (type) Value/Variable
        other method  : to_string,stoi,stoll
    */
    // เพิ่มเติมจากสไลด์
    /*
    1.การเปรียบเทียบ double ต้องระมัดระวังมากเป็นเพิเศษเพราะว่า ยิ่งหลักทศนิยมมาก/ยิ่งคำนวณด้วยตัวเลขมาก -> ผลลัพธ์คลาดเคลื่อนได้
    2.การเปรียบเทียบ string เปรียบเทียบทีละหลักจากซ้ายไปขวา อิงจากค่า ascii
        FYI : เลข ascii -> 'A' = 65,'Z'=90,'a'=97,'z'=122 ตัวพิมพ์เลขเลยมีค่ามากกว่าตัวพิมพ์ใหญ่
        ไล่ทีละหลักจากซ้ายไปขวา
        2.1 ถ้าตัวอักษรในตำแหน่งเดียวกันเป็นตัวเดียวกัน ให้ดูตัวถัดไป(ตัวทางขวา)
        2.2 ถ้าตัวอักษรในตำแหน่งเดียวกันเป็นตัวคนละตัวกัน ตัวอักษรใดมาก่อน (ค่าasciiน้อยกว่า) ทำให้สตริงนั้นมีค่าน้อยกว่า
        2.3 ถ้าตัวอักษรในตำแหน่งเดียวกันเป็นตัวคนละตัวกัน ตัวอักษรใดเป็นช่องว่าง/ไม่มีตัวอักษรเเล้ว ทำให้สตริงนั้นมีค่าน้อยกว่า
    3.block คือ bracket {} ไว้ช่วยบอกพวกif-else,loopให้ทำคำสั่งทั้งหมดภายในนั้น 
    (ปกติทำแค่ 1 คำสั่ง ที่มาอันแรกหลังจากประกาศเงื่อนไข)
    */
}